
tea ={"ชาเขียวร้อน": 40 , "ชาเขียวเย็น": 55 , "ชาเขียวปั่น": 65 ,
      "ชาไทยร้อน" : 40 , "ชาไทยเย็น": 55 , "ชาไทยปั่น": 65 ,
      "ชาดำเย็น": 55 ,
      "ชานมเย็น": 55 ,}

coffee ={"ลาเต้ร้อน" : 40 , "ลาเต้เย็น" : 55 , "ลาเต้ปั่น" : 65 , 
         "เอสเปรสโซร้อน" : 40 , "เอสเปรสโซเย็น" : 55 , "เอสเปรสโซปั่น" : 65 ,
         "คาปูชิโนร้อน" : 40 , "คาปูชิโนเย็น" : 55 , "คาปูชิโนปั่น" : 65 ,
         "มอคค่าร้อน" : 40 , "มอคค่าเย็น" : 55 , "มอคค่าปั่น" : 65 ,
         "กาแฟดำร้อน" : 40 , "กาแฟดำเย็น" : 55 , }

milk ={"นมสดร้อน" : 40 , "นมสดเย็น" : 55 , "นมสดปั่น" : 65 ,
       "โกโก้ร้อน" : 40 , "โกโก้เย็น" : 55 , "โกโก้ปั่น" : 65 ,
        "นมชมพูร้อน" : 40 , "นมชมพูเย็น" : 55 , "นมชมพูปั่น" : 65 }
       
kanom ={"เค้ก" : 100 , "คุกกี้" : 40 , "บราวนี่" : 65 ,
        "โดนัท" : 40 , "บลูเบอรี่ชีสพาย" : 100 , "บานอฟฟี่" : 80 }
 

def menu(): 
    print("รายการเครื่องดื่ม") 
    print("¤กาแฟ¤                                                              ¤ชา¤                                                      ")
    print("________________________________________________________            ________________________________________________________  ")
    print("ลาเต้ร้อน : 40 B  ลาเต้เย็น : 55 B  ลาเต้ปั่น : 65 B                        ชาเขียวร้อน : 40 B  ชาเขียวเย็น : 55 B ชาเขียวปั่น : 65 B"
          "\nเอสเปรสโซร้อน : 40 B เอสเปรสโซเย็น : 55 B เอสเปรสโซปั่น : 65 B           ชาไทยร้อน : 40 B   ชาไทยเย็น : 55 B  ชาไทยปั่น : 65 B"
          "\nคาปูชิโนร้อน : 40 B    คาปูชิโนเย็น : 55 B    คาปูชิโนปั่น : 65 B              ชาดำเย็น : 55 B"    
          "\nมอคค่าร้อน  : 40 B    มอคค่าเย็น  : 55 B    มอคค่าปั่น  : 65 B              ชานมเย็น : 55 B"
          "\nกาแฟดำร้อน : 40 B    กาแฟดำเย็น : 55 B" 
          "\n")
    print("¤ขนมหวาน¤                                                           ¤นม¤ ")
    print("________________________________________________________            ________________________________________________________")
    print("เค้ก : 100 B                                                          นมสดร้อน : 40 B  นมสดเย็น : 55 B   นมสดปั่น : 65 B"
          "\nคุกกี้ : 40 B                                                           โกโก้ร้อน : 40 B  โกโก้เย็น : 55 B   โกโก้ปั่น : 65 B"
          "\nบราวนี่ : 65 B                                                         นมชมพูร้อน : 40 B นมชมพูเย็น : 55 B  นมชมพูปั่น : 65 B"
          "\nโดนัท : 40 B"
          "\nบลูเบอรี่ชีสพาย : 100 B"
          "\nบานอฟฟี่ : 80 B"
          "\n.。･:･ ⌒♡*:･。 ⌒♥ ✧*:･ﾟ✧ ☆ﾟ.*･｡ﾟ *:･ﾟ★  ★｡･ ｡･:･ﾟ☆ ｡･:★ ♫•*¨*•.¸¸♪ ♡*:･。. +ﾟ*｡:ﾟ+.。･:･ ⌒♡*:･。 ⌒♥ ✧*:･ﾟ✧ ☆ﾟ.*･｡ﾟ *:･ﾟ★  ★｡･ ｡･:･ﾟ☆ ｡･:★ ♫•*¨*•.¸¸♪ ♡*:･。. +ﾟ*｡:ﾟ+")
    print("\n")      



def coffeess():
    Values_coffee = []
    C = 0
    sum_c = 0
    print("¤กาแฟ¤")
    print("________________________________________________________\n"
          "ลาเต้ร้อน : 40 B  ลาเต้เย็น : 55 B  ลาเต้ปั่น : 65 B\n"
          "เอสเปรสโซร้อน : 40 B  เอสเปรสโซเย็น : 55 B  เอสเปรสโซปั่น : 65 B\n"
          "คาปูชิโนร้อน : 40 B    คาปูชิโนเย็น : 55 B    คาปูชิโนปั่น : 65 B\n"
          "มอคค่าร้อน  : 40 B    มอคค่าเย็น  : 55 B    มอคค่าปั่น  : 65 B\n"
          "กาแฟดำร้อน : 40 B    กาแฟดำเย็น : 55 B\n")
    print("-----------------------------------------")
    print("['1'เพื่อชำระเงิน] ['2'เพื่อกลับหน้าเมนู]")
    while C != "1":
        C = str(input("เลือกเครื่องดื่ม : "))
        if C == "1":
            if not Values_coffee:
                print("\n♥♥ โปรดสั่งเครื่องดื่มก่อนชำระเงิน ♥♥")
                print("-----------------------------------------")
                coffeess()
            
            else:
                print("-----------------------------------------")
                print(Values_coffee, " ราคาทั้งหมด ", sum_c, " บาท")
                print ("จำนวนแสตมป์ ",stamp," ดวง")
                cont =input("\nดำเนินการต่อกดปุ่ม 'Enter'")
                if stamp < 4 :
                    print("\n☛ สามารถชำระได้ที่พร้อมเพย์ 089-090-XXXX ☚")
                    print("\n♥♥ รบกวนคุณลูกค้าชำระเงินก่อนสั่งรายการถัดไป ♥♥")
                    print("-----------------------------------------")
            
                
                if stamp >= 4 :
                     print("คุณได้รับน้ำแร่ 1 ขวด")
                     print("\n☛ สามารถชำระได้ที่พร้อมเพย์ 089-090-XXXX ☚")
                     print("\n♥♥ รบกวนคุณลูกค้าชำระเงินก่อนสั่งรายการถัดไป ♥♥")
                     print("-----------------------------------------")
            break
        
        elif C in coffee:
            Values_coffee.append(C)
            v2 = coffee.get(C)
            sum_c = sum_c+v2
            sum_c >= 50 
            stamp = sum_c//50
        
        elif C == "2":
            print("-----------------------------------------")
            break
        
        else:
            print("ไม่มีเครื่องดื่มที่คุณต้องการ")
def teas():
    Values_tea = []
    C = 0
    sum_c = 0
    print("¤ชา¤")
    print("________________________________________________________\n"
          "ชาเขียวร้อน : 40 B   ชาเขียวเย็น : 55 B ชาเขียวปั่น : 65 B\n"
          "ชาไทยร้อน : 40 B  ชาไทยเย็น : 55 B ชาไทยปั่น : 65 B\n"
          "ชาดำเย็น : 55 B\n"
          "ชานมเย็น : 55 B\n")
    print("-----------------------------------------")
    print("['1'เพื่อชำระเงิน] ['2'เพื่อกลับหน้าเมนู]")
    while C != "1":
        C = str(input("เลือกเครื่องดื่ม : "))
       
        if C == "1":
            if not Values_tea:
                print("\n♥♥ โปรดสั่งเครื่องดื่มก่อนชำระเงิน ♥♥")
                print("-----------------------------------------")
                teas()
            
            else:
                print("-----------------------------------------")
                print(Values_tea, " ราคาทั้งหมด ", sum_c, " บาท")
                print ("จำนวนแสตมป์ ",stamp," ดวง")
                cont =input("\nดำเนินการต่อกดปุ่ม 'Enter'")
                if stamp < 4 :
                    print("\n☛ สามารถชำระได้ที่พร้อมเพย์ 089-090-XXXX ☚")
                    print("\n♥♥ รบกวนคุณลูกค้าชำระเงินก่อนสั่งรายการถัดไป ♥♥")
                    print("-----------------------------------------")
            
                
                if stamp >= 4 :
                     print("คุณได้รับน้ำแร่ 1 ขวด")
                     print("\n☛ สามารถชำระได้ที่พร้อมเพย์ 089-090-XXXX ☚")
                     print("\n♥♥ รบกวนคุณลูกค้าชำระเงินก่อนสั่งรายการถัดไป ♥♥")
                     print("-----------------------------------------")
            break

        elif C in tea:
            Values_tea.append(C)
            v2 = tea.get(C)
            sum_c = sum_c+v2
            sum_c >= 50 
            stamp = sum_c//50
        
        elif C == "2":
            print("-----------------------------------------")
            break
        
        else:
            print("ไม่มีเครื่องดื่มที่คุณต้องการ")

def milks():
    Values_milk = []
    C = 0
    sum_c = 0
    print("¤นม¤")
    print("________________________________________________________\n"
          "นมสดร้อน : 40 B  นมสดเย็น : 55 B   นมสดปั่น : 65 B\n"
          "โกโก้ร้อน : 40 B  โกโก้เย็น : 55 B   โกโก้ปั่น : 65 B\n"
          "นมชมพูร้อน : 40 B นมชมพูเย็น : 55 B  นมชมพูปั่น : 65 B\n")
    print("-----------------------------------------")
    print("['1'เพื่อชำระเงิน] ['2'เพื่อกลับหน้าเมนู]")
    while C != "1":
        C = str(input("เลือกเครื่องดื่ม : "))
        if C == "1":
            if not Values_milk:
                print("\n♥♥ โปรดสั่งเครื่องดื่มก่อนชำระเงิน ♥♥")
                print("-----------------------------------------")
                milks()
            
            else:
                print("-----------------------------------------")
                print(Values_milk, " ราคาทั้งหมด ", sum_c, " บาท")
                print ("จำนวนแสตมป์ ",stamp," ดวง")
                cont =input("\nดำเนินการต่อกดปุ่ม 'Enter'")
                if stamp < 4 :
                    print("\n☛ สามารถชำระได้ที่พร้อมเพย์ 089-090-XXXX ☚")
                    print("\n♥♥ รบกวนคุณลูกค้าชำระเงินก่อนสั่งรายการถัดไป ♥♥")
                    print("-----------------------------------------")
            
                
                if stamp >= 4 :
                     print("คุณได้รับน้ำแร่ 1 ขวด")
                     print("\n☛ สามารถชำระได้ที่พร้อมเพย์ 089-090-XXXX ☚")
                     print("\n♥♥ รบกวนคุณลูกค้าชำระเงินก่อนสั่งรายการถัดไป ♥♥")
                     print("-----------------------------------------")
            break
        
        elif C in milk:
            Values_milk.append(C)
            v2 = milk.get(C)
            sum_c = sum_c+v2
            sum_c >= 50 
            stamp = sum_c//50
        
        elif C == "2":
            print("-----------------------------------------")
            break
        
        else:
            print("ไม่มีเครื่องดื่มที่คุณต้องการ")

def kanoms():
    Values_kanom = []
    Value_stamp=[]
    C = 0
    sum_c = 0
    print("¤ขนมหวาน¤")
    print("________________________________________________________\n"
          "เค้ก : 100 B\n"
          "คุกกี้ : 40 B\n"
          "บราวนี่ : 65 B\n"
          "โดนัท : 40 B\n"
          "บลูเบอรี่ชีสพาย : 100 B\n"
          "บานอฟฟี่ : 80 B\n")
    print("-----------------------------------------")
    
    print("['1'เพื่อชำระเงิน] ['2'เพื่อกลับหน้าเมนู]")
    
    while C != "1":
        C = str(input("เลือกขนม : "))
      
        if C == "1":
             

            if not Values_kanom:
                print("\n♥♥ โปรดสั่งขนมก่อนชำระเงิน ♥♥")
                print("-----------------------------------------")
                kanoms()
            
            else:
                print("-----------------------------------------")
                print(Values_kanom, " ราคาทั้งหมด ", sum_c, " บาท")
                print ("จำนวนแสตมป์ ",stamp," ดวง")
                cont =input("\nดำเนินการต่อกดปุ่ม 'Enter'")
                if stamp < 4 :
                    print("\n☛ สามารถชำระได้ที่พร้อมเพย์ 089-090-XXXX ☚")
                    print("\n♥♥ รบกวนคุณลูกค้าชำระเงินก่อนสั่งรายการถัดไป ♥♥")
                    print("-----------------------------------------")
            
                
                if stamp >= 4 :
                     print("คุณได้รับน้ำแร่ 1 ขวด")
                     print("\n☛ สามารถชำระได้ที่พร้อมเพย์ 089-090-XXXX ☚")
                     print("\n♥♥ รบกวนคุณลูกค้าชำระเงินก่อนสั่งรายการถัดไป ♥♥")
                     print("-----------------------------------------")
            break
            
        elif C in kanom:
            Values_kanom.append(C)
            v2 = kanom.get(C)
            sum_c= sum_c+v2
            sum_c >= 50 
            stamp = sum_c//50 
                
        elif C == "2":
            print("-----------------------------------------")
            break
        
        else:
            print("ไม่มีขนมที่คุณต้องการ")

#main
def choice():
    while True:
        print("         [ยินดีต้อนรับเข้าสู่ร้าน 326 The Growth CAFE]")
        print("[โปรโมชั่นของทางร้าน ทุก ๆ 50 บาทของยอดชำระคุณจะได้รับสแตมป์ 1 ดวง]")
        print("      [เมื่อสแตมป์มากกว่า 4 ดวง คุณจะได้รับน้ำแร่ฟรี 1 ขวด] ")
        print("\n1.ดูเครื่องดื่มทั้งหมด\n2.สั่งเมนูกาแฟ\n3.สั่งเมนูชา\n4.สั่งเมนูนม\n5.สั่งขนมหวาน\n0.ออกจากโปรแกรม  ")
        print("-----------------------------------------")
        try:
            x = int(input("เลือกการทำรายการ : "))
            if x == 1:
                menu()
            
            elif x == 2:
                coffeess()
            
            elif x == 3:
                teas()
            
            elif x == 4:
                milks()
                
            elif x == 5:
                kanoms()
            
            elif x == 0:
                break
            
            else:
                print("!!!***กรอกตัวเลขตามเมนูเท่านั้น***!!!")
                print("-----------------------------------------")
        except:
            print("-----------------------------------------")
            print("!!!***กรุณาใส่เฉพาะตัวเลขเท่านั้น  กรุณา!***!!!")
            print("-----------------------------------------")
choice()



